srv/Catalogs/ВерсииКонфигурацийХранилища.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВерсииКонфигурацийХранилища</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Хранилища</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиХранилища</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженаВЛокальныйРепозиторий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВХранилище</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзменения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыИзменений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзменения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыИзменений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

srv/Catalogs/ВерсииКонфигурацийХранилища/Ext/ManagerModule.bsl
Функция СобратьДанныеПоВерсиям(Версии) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версии", Версии);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииКонфигурацийХранилища.Ссылка КАК Версия,
	|	ВерсииКонфигурацийХранилища.Код КАК НомерВерсии,
	|	ВерсииКонфигурацийХранилища.НомерВХранилище КАК НомерВерсииВХранилище,
	|	ВерсииКонфигурацийХранилища.ДатаСоздания КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ВерсииКонфигурацийХранилища.Пользователь.ИмяПользователя = """"
	|			ТОГДА ВерсииКонфигурацийХранилища.Пользователь.Наименование
	|		ИНАЧЕ ВерсииКонфигурацийХранилища.Пользователь.ИмяПользователя
	|	КОНЕЦ КАК ИмяПользователя,
	|	ВерсииКонфигурацийХранилища.Пользователь.Email КАК EmailПользователя,
	|	ВерсииКонфигурацийХранилища.Комментарий КАК Комментарий
	|ИЗ
	|	Справочник.ВерсииКонфигурацийХранилища КАК ВерсииКонфигурацийХранилища
	|ГДЕ
	|	ВерсииКонфигурацийХранилища.Ссылка В(&Версии)";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Возврат ОбщегоНазначениеСервер.ТаблицаЗначенийВМассив(ТаблицаРезультат);
	
КонецФункции

Функция СобратьДанныеПоВерсии(Версия) Экспорт 
	
	Возврат СобратьДанныепоВерсиям(ГлЗначениеВМассиве(Версия))[0]; 
	
КонецФункции
